#include <stdio.h>
#include <locale.h>
void dz25()
{

	float X = 12.0f;//float т к числа могут оказаться дробными
	float Y = 8.0f;
	float Z = (X * Y) / (X + Y); //сначала находим общую производительность, потом кол-во дней т е нужную нам формулу 
	printf("   Вариант 25   ");
	printf("Задача:\n");
	printf("О двух бригадах строителей известно, что первая бригада может построить дом за %.0f дней,\n", X);
	printf("а вторая за %.0f дней при одинаковом качестве.\n", Y);
	printf("Определить сколько дней потребуется для строительства этого дома двум бригадам вместе.\n");

	printf("Решение:");
	printf("Найдем производительность первой бригады: 1/%.0f = %.2f\n", X, 1.0f / X);
	printf("Далее производительность второй бригады: 1/%.0f= %2f\n", Y, 1.0f / Y);
	printf("Определим, чему равна общая производительность: %.0f + %.0f = %.1f\n", 1.0f / X, 1.0f / Y, 1.0f / X + 1.0f / Y );
	printf("Зная общую производительность, кол-во дней которое потребуется им вместе: 1/ %.0f= %.1f\n", 1 / X + 1 / Y, Z);
	printf("Ответ: Вместе две бригады построят дом за %.1f дней\n", Z);
}

int main()
{
	setlocale(LC_CTYPE, "RUS");
	int dz25;
	return 0;
}
